cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "heroku/brew"

brew "libffi"
brew "automake"
brew "bfg"
brew "bison"
brew "chruby"
brew "ruby-install"
brew "coreutils"
brew "gdbm"
brew "git"
brew "go"
brew "libtool"
brew "imagemagick"
brew "pkg-config"
brew "libyaml"
brew "youtube-dl"s
brew "nmap"
brew "nvm"

brew "python"
brew "opencv"
brew "perl"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "redis"

brew "wget"

brew "heroku"

cask "firefox"
cask "github-desktop"

cask "visual-studio-code"
cask "google-chrome"
cask "awscli"
cask "transmit"
cask "postman"
cask "balsamiq-mockups"
cask "lastpass"
cask "arduino"
cask "balenaetcher"
cask "dash"


